Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །ཞི་བ་རིག་པ་ཡོད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་སེམས་ཅན་རྣམས་ཀྱི་ལས་འབྱང་བ་དང་། བདུད་ཀྱི་ལམ་ལས་ཡང་དག་པར་འདས་པ་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་ལ་འཇུག་པར་བྱེད་པའོ།
en: This great teaching of the peaceful core of knowledge purifies the karmic actions of sentient beings. It leads them beyond the ways of the māras and causes them to enter the domain of the buddhas.

source: །ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བར་བྱེད་པའོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་གྱི་ཕ་རོལ་ཏུ་འགྲོ་བ་དང་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བར་བྱེད་པའོ།
en: It provides control over all phenomena, it perfects the eighteen unique qualities of the buddhas, and it turns the wheel of the Dharma.

source: །ཆོས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པར་བྱེད་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པའོ། །བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བྱེད་པ་སྟེ།
en: It causes the Dharma rain to fall, it ripens all sentient beings, and it leads to unsurpassed parinirvāṇa.

source: འདི་ནི་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་ཡིན་ནོ།
en: This is the great teaching of the peaceful core of knowledge.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་པ་འདི་བཤད་པ་ན་གང་དུ་སེམས་ཅན་དེ་ལྟ་བུ་རྣམས་ཀྱི་ལས་ཀྱི་སྒྲིབ་པ་སྔོན་འཕངས་ཤིང་ཡོངས་སུ་མ་ཟད་པའི་ལྷ་དང་མི་གྲངས་མེད་པ་དཔག་ཏུ་མེད་པ་དག་ནི་དེར་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: As this teaching was being given by the Blessed One, an innumerable and limitless number of gods and humans present there, those whose karmic obscurations generated in the past were not yet exhausted, attained the eye of Dharma that is immaculate and spotless with regard to phenomena.

source: །སེམས་ཅན་དཀྲིགས་ཕྲག་འབུམ་གྱིས་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: The minds of myriads of beings were liberated from their defilements with no further grasping.

source: །དེའི་ཚེ་ཁྲི་ཕྲག་བདུན་ཅུ་ནི་ཞི་བ་རིག་པ་ཡོད་པའི་སྦུབས་ཀྱི་གཟུངས་སྔགས་འདི་ཐོབ་པར་གྱུར་ཅིང་ཐེག་པ་གསུམ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡང་གྱུར་ཏོ།
en: At that time, seven hundred thousand beings attained the dhāraṇī mantra peaceful core of knowledge and would no longer regress from the three vehicles.

source: །དེའི་ཚེ་ལྷ་དང་མི་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡང་གྱུར་ཏོ།
en: An innumerable and limitless number of gods and humans gave rise to the mind set on unsurpassed and perfect awakening and would no longer regress on the path to unsurpassed and perfect awakening.

source: །དེའི་ཚེ་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Also, eighty-four thousand beings reached the acceptance of the unborn nature of phenomena.

source: །སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱིས་གཟུངས་སྔགས་བཞི་པོ་བདེན་པ་དང་། རྗེས་སུ་འཐུན་པ་དང་། སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པ་དང་། སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པ་དང་། ཞི་བ་རིག་པ་ཡོད་པའི་སྦུབས་ཀྱི་གཟུངས་སྔགས་དེ་དག་གི་དོན་བསྟན་པ་ཐོབ་ནས་དེའི་ཚེ་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གི་འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་དང་། དབྱིབས་ཀྱི་འདོད་ཆགས་དང་། རེག་པའི་འདོད་ཆགས་དང་། མོས་པའི་འདོད་ཆགས་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཡོངས་སུ་ཟད་དོ། །འདོད་ཆགས་པ་རྣམས་ཀྱི་ཉེས་དམིགས་ཀྱང་རང་གི་མངོན་སུམ་དུ་གྱུར་ཏོ། །
en: After the beings present throughout this entire buddha realm of Sahā received these teachings on the meaning of those four dhāraṇī mantras—the dhāraṇī mantra that accords with the truth, the dhāraṇī mantra that accords with emptiness, the dhāraṇī mantra that accords with the absence of wishes, and the dhāraṇī mantra peaceful core of knowledge—all attachments related to the desire realm, the form realm, shape, contact, longing, and the formless realm of an innumerable and limitless number of them were exhausted, and their defects became clear to them.

source: ཁ་ཅིག་གིས་ནི་མི་སྡུག་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད་དོ། །ཁ་ཅིག་གིས་ནི་སྐྱེ་མཆེད་དྲུག་གོ། །ཁ་ཅིག་གིས་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དོ། །ཁ་ཅིག་གིས་ནི་ཟད་པར་གྱི་སྐྱེ་མཆེད་དོ། །ཁ་ཅིག་གིས་ནི་དབུགས་རྔུབ་པ་དང་དབུགས་འབྱུང་བ་དྲན་པའོ། །ཁ་ཅིག་གིས་ནི་ཞི་གནས་སོ། །ཁ་ཅིག་གིས་ནི་ལྷག་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བསམ་གཏན་དང་པོའོ། །ཁ་ཅིག་གིས་ནི་བསམ་གཏན་ཁྱད་པར་ཅན་ནོ། །ཁ་ཅིག་གིས་ནི་བསམ་གཏན་བཞི་པའི་བར་རོ། །ཁ་ཅིག་གིས་ནི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སོ། །ཁ་ཅིག་གིས་ནི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པའོ། །ཁ་ཅིག་གིས་ནི་རིགས་ཀྱི་སའོ། །ཁ་ཅིག་གིས་ནི་བརྒྱད་པའི་ཆོས་རྣམས་སོ། །
en: Some produced the roots of virtue of repulsiveness, while others gave rise to the six spheres, the spheres of mastery, the spheres of totality, the mindfulness of breathing, tranquility, special insight, the first concentration, the other particular concentrations up to the fourth one, the formless attainments, the acceptance that accords with the truth, the level of the family, and the qualities of the eighth level.

source: ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་དང་ཐུན་མོང་བའི་དགེ་བའི་རྩ་བ་རྣམས་སྐྱེད་དོ། །ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་དང་ཐུན་མོང་བའོ། །ཁ་ཅིག་གིས་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། ཐུན་མོང་བའི་ཏིང་ངེ་འཛིན་དང་། བཟོད་པ་དང་། གཟུངས་ཀྱི་དགེ་བའི་རྩ་བ་རྣམས་སྐྱེད་དོ།
en: Some others also produced the roots of virtue that are common to the hearers, the roots of virtue that are common to the solitary buddhas, and the roots of virtue related to omniscient wisdom, as well as the common absorptions, acceptance, and recall.

source: །དེའི་ཚེ་བུད་མེད་གང་དག་སེམས་རྩེ་གཅིག་པ་དང་། བུད་མེད་ཀྱི་དངོས་པོ་སྐྱོན་དུ་བགྲང་བའི་སེམས་ཀྱིས་ཚུལ་བསྟན་པ་འདི་ཐོས་པ་དེ་ལས་མིའི་བུད་མེད་དཀྲིགས་ཕྲག་དགུ་བཅུ་རྩ་གཅིག་གི་མོ་མཚན་ནུབ་པར་གྱུར་ཅིང་ཕོ་མཚན་ཡང་བྱུང་བར་གྱུར་ཏོ།
en: At that time, when ninety-one trillion women listened one-pointedly to this teaching with the understanding that the female condition is flawed, their female genitals disappeared, and instead they developed male genitals.

source: །ལྷའི་བུ་མོ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དང་། ཀླུའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་སྙེད་དང་། གནོད་སྦྱིན་གྱི་བུ་མོ་བརྒྱད་ཁྲི་དྲུག་སྟོང་སྙེད་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་བརྒྱད་ཅུ་རྩ་བཞི་སྙེད་དང་། ནམ་མཁའ་ལྡིང་གི་བུ་མོ་བདུན་ཁྲི་སྙེད་དང་། མི་འམ་ཅིའི་བུ་མོ་དཀྲིགས་ཕྲག་བཅུ་གཉིས་སྙེད་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་སྟོང་སྙེད་དང་། ཡི་དགས་མོ་དཀྲིགས་ཕྲག་དགུ་བཅུ་སྙེད་དང་། ཤ་ཟ་མོ་དཀྲིགས་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་སྙེད་ཀྱི་བུ་མོ་མོ་མཚན་ནུབ་པར་གྱུར་ཅིང་ཕོ་མཚན་བྱུང་བར་གྱུར་ཏོ།
en: Likewise, the female genitals disappeared on nine hundred ninety million goddesses, eighty-four thousand female nāgas, eighty-six thousand female yakṣas, eighty-four female asuras, seventy thousand female garuḍas, twelve trillion female kinnaras, one thousand female mahoragas, ninety trillion female pretas, and forty-two trillion female piśācas, and they all developed male genitals.

source: །གང་བུད་མེད་སྦྲུམ་པ་དེ་ཡང་ངས་ལུས་དང་སེམས་ཀྱི་བདེ་བ་མཆོག་ལ་ཡང་དག་པར་གཏད་དེ།
en: Pregnant women were filled with supreme physical and mental happiness.

source: ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གཏོགས་པ་ཡང་རུང་། ཐོ་འཚམ་པ་མེད་པའི་ལུས་དང་ལྡན་པ་དང་། འཁྲུག་པ་མེད་པའི་སེམས་དང་ལྡན་པར་ཁྱེའུའམ་བུ་མོ་བཙས་པར་གྱུར་ཏོ།
en: Even within the animal realms, beings gave birth to male and female offspring without experiencing any form of physical harm or mental distress.

source: །བཙས་ནས་ཀྱང་དབང་པོ་ཚང་བ་དང་། གཟུགས་མཆོག་དང་ལྡན་པ་དང་། དྲན་པ་དང་ལྡན་པ་དང་། ཚེ་རབས་དྲན་པ་དང་། དཔའ་བ་དང་། སྲན་ཐུབ་པ་དང་། ཤེས་རབ་དང་ལྡན་པར་གྱུར་ཏོ།
en: These babies were born with unimpaired faculties, perfect physical forms, the power of recall, and the ability to remember past lives, and they were all endowed with courage, endurance, and insight.

source: །གང་སྦྲུམ་པ་བཙའ་བར་མི་བྱེད་པ་དེའི་ནད་ཐམས་ཅད་ངས་རབ་ཏུ་ཞི་བར་བྱས་སོ། །མངལ་ན་ཡོད་པ་དེ་ཡང་ཚུལ་དེ་ལྟ་བུའི་བདེ་བ་དང་ཡང་དག་པར་ལྡན་པར་བྱས་ཏེ།
en: All the diseases that could prevent pregnant women from giving birth were completely pacified, and the children in their wombs obtained that same level of well-being.

source: ལུས་དང་སེམས་ཀྱི་བདེ་བ་དང་ཡང་དག་པར་ལྡན་པར་བྱས་ནས་ཀྱང་དེ་ཕྱིས་བདེ་བ་མཆོག་གིས་ཁྱེའུ་དང་བུ་མོ་བཙས་ཏེ།
en: After attaining such physical and mental well-being, the baby boys and girls were born with perfect ease.

source: གཟུགས་མཆོག་དང་ལྡན་པ་དང་། དྲན་པ་མཆོག་དང་ལྡན་པ་དང་། ཚེ་རབས་དྲན་པ་དང་། དཔའ་བ་དང་། སྲན་ཐུབ་པ་དང་། ཤེས་རབ་དང་ལྡན་པའི་བར་དུ་གྱུར་ཏོ།
en: Their appearances were perfect, they possessed the supreme power of recall and the ability to remember their past lives, and they were endowed with courage, endurance, and insight.

source: །དེ་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། སྲུལ་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ།
en: Then all the gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, kumbhāṇḍas, pūtanas, humans, and nonhumans applauded and exclaimed, “Blessed One, this is excellent!

source: །དེ་བཞིན་གཤེགས་པས་ད་ལྟར་སྔོན་མ་ཐོས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ།
en: Today the Thus-Gone One has turned the wheel of the Dharma that had never been heard before.

source: སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པའི་ལས་ཀྱི་སྒྲིབ་པ་ཡང་དག་པར་འབྱང་བ། འཁོར་བ་ལས་སྒྲོལ་བ། སྲིད་པར་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་འབྱང་བ། བདུད་རྩིའི་བྱང་གྲོལ་གྱིས་ཡང་དག་པར་ཚིམ་པར་མཛད་པ་ནི་མཆོག་ཏུ་ངོ་མཚར་ལགས་སོ།
en: It purifies the karmic obscurations of mental concepts, it liberates from saṃsāra, it purifies all destinies in existence, and it brings satisfaction through the nectar of emancipation. This is truly amazing!

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཐམས་ཅད་ཀུན་ཏུ་སྲུང་བ་དང་། རྙོག་པའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་འབྱང་བ་དང་། ཤེས་རབ་མཆོག་གི་མིག་ཐོབ་པར་བགྱི་བ་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅད་པའི་སླད་དུ། དེ་བཞིན་གཤེགས་པས་ད་ལྟར་སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་སྣང་བར་མཛད་པའི་ཆོས་ཀྱི་ཆར་རབ་ཏུ་ཕབ་ལགས་ཏེ།
en: Today, the Thus-Gone One has showered down a Dharma rain that illuminates all buddha realms. He has done so in order to protect all those beings who have reached maturity, to purify all their defilements, to bring about their attainment of the eye of supreme insight, and to ensure that the lineage of the Three Jewels remains uninterrupted.

source: དེ་བཞིན་གཤེགས་པ་ལ་བདག་ཅག་གིས་རྔོ་ཅི་ཐོགས་པར་མཆོད་པ་བགྱི་ལགས་སོ།
en: We shall worship the Thus-Gone One to the best of our ability!”

source: །བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་ལ་བརྩོན་པ་རྣམས་མ་གཏོགས་པར་ལྷ་ཐམས་ཅད་ཅེས་བྱ་བ་ནས་ལུས་སྲུལ་པོའི་བར་གྱིས་ཀྱང་ལྷ་རྫས་ཀྱི་རོལ་མོའི་སྒྲ་དང་ཕེག་རྡོབ་པའི་སྒྲ་འབྱུང་བར་བྱེད་དོ།
en: Besides those who were exerting themselves in absorption, all the gods and the others up to the pūtanas offered divine music and played instruments to worship the Blessed One.

source: །ལྷ་རྫས་ཀྱི་གསེར་གྱི་ཕྱེ་མའི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ་ཞེས་བྱ་བ་ནས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། སྤོས་དང་། བདུག་པ་དང་། རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། རྒྱན་དང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་ཕྲེང་གི་བར་གྱི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ།
en: They showered down a rain of divine golden powder as well as rains of divine flowers, perfume, incense, fine cloths, Dharma robes, ornaments, and divine flower garlands.

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཉི་མ་ཤར་བ་ལ་ཡང་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་རིན་པོ་ཆེའི་མེ་ཏོག་དང་། སྤོས་དང་། བདུག་པ་དང་། རས་བཅོས་བུ་དང་། ཕྲེང་བ་རྣམས་གཏོར་ཏོ།
en: To worship the Blessed One, who was like the rising sun, they also tossed precious flowers, perfumes, incense, fine cloths, and garlands.

source: །འཕགས་པ་འདུས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་ཉི་མའི་སྙིང་པོའི་ལེའུ་བཅུ་གཅིག་པ་ལས་ལས་འབྱང་བའི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: This concludes the chapter called “The Purification of Karmic Actions,” the fourth among the eleven chapters in “The Quintessence of the Sun,” the noble Great Vehicle discourse of The Great Assembly.

source: དེ་ནས་དེ་སྙེད་ཀྱི་ལྷའི་དབང་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དང་། ཀླུའི་དབང་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་དང་། མི་འམ་ཅིའི་དབང་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དང་། ཡི་དགས་ཀྱི་དབང་པོ་དང་། ཤ་ཟའི་དབང་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དང་། ལུས་སྲུལ་པོའི་དབང་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་རབ་ཏུ་བཏུད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་དང་གང་དུ་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། དད་པ་དང་ལྡན་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་མི་སྡུག་པ་སྔོན་དུ་གཏོང་བ་ཚུལ་དེ་ལྟ་བུས་ཞེས་བགྱི་བ་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པའི་བར་གྱི་ཚུལ་གྱིས་གནས་པར་བགྱིད་ལ། ཇི་ལྟར་སྔར་བཤད་པའི་དགེ་བའི་ཕྱོགས་ཡིད་ལ་བགྱིས་པས་གནས་པར་བགྱིད་ན་དད་པ་དང་ལྡན་པའི་རིགས་ཀྱི་བུ་མོའི་བར་འཁོར་དང་བཅས་པ་ཐམས་ཅད་ལ་ཡང་རང་གི་རིས་ཀྱི་སྟོན་པའི་འདུ་ཤེས་གཟུང་བར་བགྱིའོ།
en: Then, together with their respective retinues, all the rulers of the gods, the rulers of the nāgas, the rulers of the yakṣas, the rulers of the asuras, the rulers of the garuḍas, the rulers of the kinnaras, the rulers of the mahoragas, the rulers of the pretas, the rulers of the piśācas, and the rulers of the pūtanas bowed with their palms joined together in the direction of the Blessed One and said, “Respected Blessed One, in all the places where monks, nuns, male and female lay practitioners, or faithful sons or daughters of noble family observe this initial practice of repulsiveness up to the absorption of cessation while contemplating the virtuous factors that have just been described, we shall regard them—up to the faithful daughters of noble family—together with their retinues as the teachers of their own respective classes.

source: །ལུས་དང་སེམས་དང་ཡིད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་རིམ་གྲོའི་སྤྱོད་པ་བགྱིའོ། །ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་མི་བྲེལ་བར་བགྱིའོ།
en: We shall serve all of them through body, speech, and mind, and we shall ensure that they never lack Dharma robes, alms, bedding, medicine, and requisites.

source: །ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་བཅྭ་ལྔ་ལས་ཡོངས་སུ་ཐར་བར་བགྱིའོ།
en: We shall liberate them from the fifteen unsettling dangers.

source: །བཅྭ་ལྔ་གང་ཞེ་ན། ལུས་ཀྱི་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་ལས་ཡོངས་སུ་ཐར་བར་བགྱིའོ།
en: What are those fifteen? We shall liberate them from the unsettling dangers related to the body.

source: །བོང་བ་དང་། དབྱུག་གུ་དང་། མཚོན་ཆ་དང་། དུག་དང་། རྡོ་དང་། སེམས་ཅན་སྡང་བ་དང་། རྩུབ་པ་དང་། དད་པ་མ་མཆིས་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་བགྱིའོ།
en: We shall liberate them from dirt, sticks, weapons, poison, stones, hostile beings, abusive beings, and faithless beings.

source: །ཁམས་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་ལས་བསྲུང་བར་བགྱིའོ།
en: We shall liberate them from disturbances in the elements.

source: །ཇི་ལྟར་འཐུན་པའི་བཟའ་བ་དང་། བཏུང་བ་དང་། སྨན་དང་། ཡོ་བྱད་ཀྱི་གཞི་ལས་རིམ་གྲོ་བ་དང་། ཉེ་དུ་དང་། སྦྱིན་པ་པོ་དང་། སྦྱིན་བདག་ཡོངས་སུ་མི་ཉམས་པའི་ཆོས་ཅན་རྣམས་ནད་དང་དགྲའི་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་དང་། འབྱུང་པོ་ཐམས་ཅད་དང་། དགྲ་ཐམས་ཅད་ཀྱི་ཀུན་དུ་འཁྲུག་པའི་འཇིགས་པ་ལས་བསྲུང་བར་བགྱིའོ།
en: We shall protect those who serve them with offerings of delicious food and beverages, medicine, and requisites. We shall protect all such righteous sponsors, relatives, and benefactors from the unsettling dangers caused by diseases, enemies, bhūtas, and foes.

source: །དུག་གི་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་དང་། རྒྱལ་པོའི་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་དང་། ནང་གི་དམག་ཚོགས་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། མུ་གེའི་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་ལས་ཡོངས་སུ་བསྲུང་བར་བགྱི་སྟེ།
en: We shall protect them from the unsettling dangers caused by poison, kings, civil war, invasion, and famine.

source: ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་བཅྭ་ལྔ་པོ་དེ་དག་གོ།
en: Those are the fifteen unsettling dangers.

source: །གང་དག་ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན་དམ་པའི་ཆོས་ལྟར་བཅོས་པ་ལ་གནས་པའི་བར་གྱི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། དད་པ་དང་ལྡན་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་དང་། གང་དག་མི་སྡུག་པ་སྔོན་དུ་གཏོང་བའི་ཚུལ་དེ་ལྟ་བུས་ཞེས་བགྱི་བ་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པའི་བར་གྱི་ཚུལ་གྱིས་གནས་པར་བགྱིད་ལ། ཇི་སྐད་སྔར་བཤད་པ་བཞིན་ནམ་གྱི་ཆ་སྟོད་དང་ནམ་གྱི་ཆ་སྨད་ལ་མི་ཉལ་བར་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་གནས་པར་བགྱིད་པ་འཁོར་དང་བཅས་པ་དེ་དག་ཐམས་ཅད་དང་། གང་དུ་གནས་པའི་ཡུལ་འཁོར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། རི་འོར་དང་། གྲོང་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དེ་དག་དང་། དགོན་པའི་གནས་དེ་དག་རང་གི་རིས་ཀྱི་ཁྱིམ་ཁོལ་གྱི་ཁྱིམ་གྱི་བར་བཞིན་དུ་གཟུང་བར་བགྱིའོ།
en: “We shall regard as our own family members all present and future monks, nuns, male and female lay practitioners, and faithful sons or daughters of noble family—even those who merely maintain an imitation of the sacred Dharma—as well as those who abide by this initial practice of repulsiveness up to the absorption of cessation and who sleeplessly exert themselves during the first and last parts of the night in the endeavors that have been described before. We shall regard the regions, cities, countries, mountain hamlets, towns, capitals, and solitary places where they reside as the dwelling places of our own families.

source: །ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་བཅྭ་ལྔ་པོ་དེ་དག་ལས་ཡོངས་སུ་བསྲུང་བར་བགྱིའོ། །སླར་བཟློག་པར་བགྱིའོ།
en: We shall avert and repel those fifteen unsettling dangers.

source: །གང་དུ་དེ་ལྟ་བུའི་དགེ་བ་ལ་བརྩོན་པ་ཐ་ན་གང་ཟག་གཅིག་ཅིག་གནས་པར་བགྱིད་ཀྱང་རུང་། དེར་ཐ་ན་ཉིན་ཞག་གཅིག་ཅིག་གནས་པར་བགྱིད་ཀྱང་རུང་སྟེ། ཡུལ་འཁོར་དེ་དག་རང་གི་རིས་ཀྱི་ཁྱིམ་ཁོལ་གྱི་ཁྱིམ་གྱི་བར་བཞིན་དུ་གཟུང་བར་བགྱིའོ།
en: We shall regard as the dwelling place of our own families any region where even just one single person who applies effort in such virtuous deeds resides, even if that person remains there for only a single day.

source: །ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་བཅྭ་ལྔ་ལས་ཡོངས་སུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: We shall protect and defend those persons against those fifteen unsettling dangers.

source: །སྦྱིན་པ་པོ་དང་། སྦྱིན་བདག་རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་དག་ཀྱང་རང་གི་རིས་ལགས་པར་གཟུང་བར་བགྱིའོ།
en: We shall regard those almsgivers, benefactors, members of the kṣatriya class, brāhmaṇas, vaiśyas, śūdras, men, women, boys, and girls as members of our own groups.

source: །ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་བཅྭ་ལྔ་པོ་དེ་དག་ལས་རྗེས་སུ་བསྲུང་བར་བགྱིའོ།
en: We shall protect and defend them against those fifteen unsettling dangers.

source: །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །གང་དག་དེ་ལྟ་བུའི་དགེ་བའི་ཕྱོགས་ལ་བརྩོན་པའི་གང་ཟག་རྣམས་ལ་གནས་ཁང་དང་། གཙུག་ལག་ཁང་དང་། ཀུན་དགའ་ར་བ་དང་། གནས་དང་། ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བཀུར་སྟི་དང་། མཆོད་པ་དང་། རིམ་གྲོ་བགྱིད་པ་དག་ཀྱང་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་དེ་ལྟ་བུ་དེ་དག་ལས་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: We shall also protect and defend against these unsettling dangers those who venerate, worship, and serve others who exert themselves in such virtuous endeavors by offering them houses, temples, monastic compounds, land, Dharma robes, alms, bedding, medicine, and tools.

source: །གང་ཡང་བུད་མེད་སྦྲུམ་པ་གང་ཟག་དེ་ལྟ་བུ་དག་ལ་བཀུར་སྟི་བགྱིད་པ་དེ་ལ་དུས་རྟག་ཏུ་རྣམ་པར་མི་འཚེ་བའི་ཆོས་ཅན་དང་། ནད་མ་མཆིས་པ་དང་། མཆོག་ཏུ་དགའ་བ་མང་བར་བདག་ཅག་གིས་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: We shall protect and defend those pregnant women who show respect to such people, ensuring that they always remain safe and free from disease and experience many intense joys.

source: །ཡང་གང་དང་གང་དུ་དེ་ལྟ་བུར་ཚུལ་བཞིན་ཡིད་ལ་བགྱིད་པ་ལ་བརྩོན་པའི་གང་ཟག་ལ་སྙིང་བརྩེ་བར་གསོལ་བ་འདེབས་པར་བགྱིད་པ་དག་དང་། དེའི་མིང་བརྗོད་པར་བགྱིད་པ་དག་དང་། སྐུད་པ་བཏགས་པའམ། ཀུན་ཏུ་བསྲུང་བ་བགྱིད་པའམ། མི་དགེ་བ་ལས་སླར་བཟློག་པའམ། དགེ་བ་ལ་སྦྱོར་དུ་སྩལ་བ་འང་རུང་སྟེ། སེམས་ཅན་དེ་དག་ཀྱང་ཀུན་ཏུ་འཁྲུག་པའི་འཇིགས་པ་བཅྭ་ལྔ་པོ་དེ་དག་ལས་བདག་ཅག་གིས་རྗེས་སུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །
en: We shall also protect from and defend against those fifteen unsettling dangers anyone who supplicates with affection those who exert themselves in such genuine contemplations, anyone who proclaims their names, anyone who ties the string, anyone who protects them, anyone who opposes nonvirtuous deeds, and anyone who incites others to engage in virtuous deeds.

source: མི་དང་མི་མ་ལགས་པའི་སེམས་ཅན་གང་དག་དེ་ལྟ་བུའི་དགེ་བའི་ཕྱོགས་ལ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པར་བརྩོན་པའི་གང་ཟག་རྣམས་ཀྱི་ཚིག་མི་ཉན་ཞིང་། མི་བགྱི་བར་སེམས་པ་དག་དང་། གང་དག་དེ་དག་ལ་གཤེ་བར་བགྱིད་པའམ། ཕན་པ་མ་ལགས་པ་དང་། དོན་མ་ལགས་པ་དང་། བར་དུ་ཉམས་པ་དང་། གནོད་སེམས་སུ་བགྱི་བའི་སླད་དུ་རྟུལ་བར་བགྱིད་པའི་སེམས་ཅན་དེ་དག་གི་ཐད་དུ་བདག་ཅག་གིས་མི་དང་མི་མ་ཡིན་པ་དག་གཏང་བར་བགྱིའོ།
en: “We shall send humans and nonhumans to oppose any human or nonhuman beings who intend to ignore the words of those persons who strive in properly contemplating such virtuous endeavors, as well as those who intend to disregard, abuse, oppose, harm, or utterly corrupt those persons and harbor ill will toward them.

source: །དེ་ལ་བཟོད་པར་མི་བགྱིའོ།
en: We shall not tolerate them.

source: །གང་དག་དེ་ལྟ་བུའི་དགེ་བའི་ཕྱོགས་ལ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པར་བརྩོན་པའི་གང་ཟག་རྣམས་ཀྱི་ཚིག་མི་མཉན་ཞིང་མི་བགྱི་བར་སེམས་པ་དག་དང་། གང་དག་དེ་དག་ལ་གཤེ་བར་བགྱིད་པའམ། དོན་མ་ལགས་པ་དང་། ཕན་པ་མ་ལགས་པ་དང་། གནོད་སེམས་དང་། བར་དུ་ཉམས་པར་བགྱི་བའི་སླད་དུ་རྟུལ་བར་བགྱི་བའི་སེམས་ཅན་དེ་དག་ནི་གནོད་པ་བཅྭ་ལྔ་པོ་འདི་དག་དང་ལྡན་པར་འགྱུར་ལགས་སོ།
en: Those sentient beings who intend to ignore the words of those who strive in properly contemplating such virtuous endeavors and those sentient beings who intend to disregard, abuse, oppose, harm, or harbor ill will toward those persons and utterly corrupt them will experience fifteen harms.

source: །བཅྭ་ལྔ་གང་ཞེ་ན།
en: What are those fifteen?

source: མྱུར་དུ་ནད་ཀྱི་སྡུག་བསྔལ་དང་། ལོངས་སྤྱོད་ཀྱི་སྡུག་བསྔལ་དང་། ཉེ་བར་སྤྱོད་པ་ལས་ཡོངས་སུ་ཉམས་པའི་སྡུག་བསྔལ་དང་། ཡན་ལག་དང་ཉིང་ལག་གཅོད་པའི་སྡུག་བསྔལ་དང་། འཁོར་སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་དང་། དབང་ཕྱུག་ལས་རྒུད་པའི་སྡུག་བསྔལ་དང་། གནས་ཀྱི་སྡུག་བསྔལ་དང་། དགྲས་རྫི་བའི་སྡུག་བསྔལ་དང་། རྟག་ཏུ་སེམས་ཀུན་ཏུ་འཁྲུག་པའི་སྡུག་བསྔལ་དང་། ཡུལ་འཁོར་གྱི་སྡུག་བསྔལ་དང་། རྒྱལ་རིགས་ཀྱི་ཀུན་ཏུ་འཁྲུག་པའི་སྡུག་བསྔལ་དང་། ཆོམ་རྐུན་གྱི་ཀུན་ཏུ་འཁྲུག་པའི་སྡུག་བསྔལ་དང་། བུད་མེད་ཀྱི་ཀུན་ཏུ་འཁྲུག་པའི་སྡུག་བསྔལ་དང་། མྱུར་དུ་ཚེ་ཟད་པ་དང་། འཆི་བའི་སྡུག་བསྔལ་ལགས་སོ།
en: They will experience (1) the suffering of quickly becoming sick, (2) the suffering related to the loss of their wealth, (3) the suffering related to the deterioration of their possessions, (4) the suffering of their main and secondary limbs being cut off, (5) the suffering of being separated from their beloved retinues, (6) the suffering related to the decline of their power, (7) the suffering related to their dwelling places, (8) the suffering of being crushed by enemies, (9) the suffering of being constantly disturbed in their minds, (10) the suffering related to their realm, (11) the suffering related to disturbances caused by the members of the kṣatriya class, (12) the suffering related to disturbances caused by thieves, (13) the suffering related to the disturbances caused by women, (14) the suffering related to the quick exhaustion of their lifespan, and (15) the suffering of death.

source: །སེམས་ཅན་དེ་དག་ནི་གནོད་པ་དེ་དག་དང་མྱུར་དུ་ལྡན་པར་འགྱུར་ལགས་སོ།
en: Those sentient beings will quickly experience those harms.

source: །སེམས་ཅན་གང་དག་དེ་ལྟ་བུའི་ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་ལ་བརྩོན་པ་རྣམས་ཀྱི་ཚིག་མི་མཉན་ཞིང་། མི་བགྱིད་པར་སེམས་པ་དང་། དེ་དག་ལ་ཡང་གཤེ་བར་བགྱིད་པའམ། དོན་མ་ལགས་པ་དང་། ཕན་པ་མ་ལགས་པ་དང་། གནོད་སེམས་དང་། བར་དུ་ཉམས་པར་བགྱི་བའི་སླད་དུ་བརྟུལ་བར་བགྱིད་པའི་སེམས་ཅན་དེ་དག་སྐྲག་ནས་བདག་ཅག་ལ་སྐྱབས་སུ་མཆིས་ཀྱང་རུང་། གསང་སྔགས་སྣ་ཚོགས་སྒྲུབ་པའི་ཡོ་བྱད་ཀྱིས་རིམ་གྲོ་བགྱི་བར་བརྩོན་པར་བགྱིས་སུ་ལགས་ཀྱང་དེ་དག་གི་དོན་དུ་བདག་ཅག་གིས་རིམ་གྲོའི་བསྙེན་བཀུར་བླང་བར་མི་བགྱིའོ། །དེ་དག་གི་སྐྱབས་མི་བགྱིའོ།
en: “Even if those sentient beings who intend to ignore the words of those who strive in properly contemplating in this way or who intend to disregard, abuse, oppose, harm, or harbor ill will toward those persons and utterly corrupt them take refuge in us out of fear and eagerly serve us with substances to accomplish a variety of mantras, we shall not accept such acts of service to fulfill their purposes, and we shall not give refuge to them.

source: །དེ་དག་གི་བགྱི་བ་མི་སྒྲུབ་པོ། །དོན་བསྒྲུབ་པར་མི་བགྱིའོ། །
en: We shall not accomplish their activities or benefit them.

source: ཕུང་ཀྲོལ་གྱི་ལྷའམ། ཀླུ་ནས་ལུས་སྲུལ་པོའི་བར་སྡང་བ་སྙིང་བརྩེ་བ་མ་མཆིས་པ། བགྱིས་པ་མི་གཟོ་བ།
en: “There will be troublemakers—from gods and nāgas up to kaṭapūtanas—who are hostile, ruthless, ungrateful, and unafraid of the afterlife.
